mu=[3 1;
    5 2];
sigma=[0.5 0.5;
        0.9 0.9];
r=mvnrnd(mu(1,:),sigma(1,:),100);%норпм распр 1 класс
r1=mvnrnd(mu(2,:),sigma(2,:),100);%норм распр 2 класс
%plot(r(:,1),r(:,2),'+',r1(:,1),r1(:,2),'o');% построение первого график
ra=randi([1 2]);%рандом 1 или 2 (выбор класса)
r2=mvnrnd(mu(ra,:),sigma(ra,:),1);%рандомная точка в 1 или 2 классе
%disp('Новый элемент');
disp('Мат ожидание');
disp(mu(ra,1));
disp('Среднеквадратичное отклонение');
disp(sigma(ra,1));
figure(1);
plot(r(:,1),r(:,2),'og',r1(:,1),r1(:,2),'ob',r2(:,1),r2(:,2),'*r');
%%%%%%%%%%%%%%%
U1=et(r,r1);%эталоны 1 класса
U2=et(r1,r);%эталоны 2 класса
%U2=et(r1,r);
figure(2);
plot(r2(:,1),r2(:,2),'*r',U1(:,1),U1(:,2),'+g',U2(:,1),U2(:,2),'+b');
figure(3);
plot(r(:,1),r(:,2),'og',r1(:,1),r1(:,2),'ob',r2(:,1),r2(:,2),'*r',U1(:,1),U1(:,2),'+g',U2(:,1),U2(:,2),'+b');
y=FRiS(U1,U2,0.25,0.81, r2);
% if ra==y
%     disp('Верно');
% end
noerr=0;
for i=1:100
    ra=randi([1 2]);%рандом 1 или 2 (выбор класса)
    r2=mvnrnd(mu(ra,:),sigma(ra,:),1);%рандомная точка в 1 или 2 классе
    y=FRiS(U1,U2,0.25,0.81, r2);
    if ra==y
        noerr=noerr+1;
    end
end
disp('Процент без ошибки:')
disp(noerr/100);
disp('Процент ошибки:')
disp(1-(noerr/100))